diary/201607/13.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>利用github创建个人博客</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="利用github创建个人博客"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2016-07-23T18:52+0800"/>
<meta name="author" content="ALIANG"/>
<meta name="description" content=""/>
<meta name="keywords" content="DIARY"/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">利用github创建个人博客</h1>

<p>【aliang diary】-青春无限可能，拎得清，爱生活，爱自己
</p>
<p>
-日期：2016-07-12；作者：阿亮；关键字：笔记、github
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 利用github创建个人博客</a>
<ul>
<li><a href="#sec-1-1">1.1 介绍</a></li>
<li><a href="#sec-1-2">1.2 创建步骤</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 github上建立仓库</a></li>
<li><a href="#sec-1-2-2">1.2.2 填写项目信息</a></li>
<li><a href="#sec-1-2-3">1.2.3 完成创建。</a></li>
<li><a href="#sec-1-2-4">1.2.4 后续完善</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 体验链接</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 利用github创建个人博客</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 介绍</h3>
<div class="outline-text-3" id="text-1-1">

<p>GitHub Pages分两种
</p><ul>
<li>以自己的GitHub用户名建立的username.github.io这样的用户&amp;组织页（站）
</li>
<li>依附项目的pages。
</li>
</ul>

<p>建立个人博客是用的第一种，形如anbgsl1110.github.io这样的可访问的站，每个用户名下面只能建立一个。
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 创建步骤</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> github上建立仓库</h4>
<div class="outline-text-4" id="text-1-2-1">

<p>登录后系统，在github首页，点击页面右下角「New Repository」
</p>
</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> 填写项目信息</h4>
<div class="outline-text-4" id="text-1-2-2">




<pre class="src src-txt">project name&#65306;cnfeat.github.io
description&#65306; Writing 1000 Words a Day Changed My Life
</pre>

<p>
<b>备注：repository名字是特定的 比如:我的github账号是anbgsl1110，那么我github pages repository名字就是anbgsl1110.github.io。</b>
</p></div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> 完成创建。</h4>
<div class="outline-text-4" id="text-1-2-3">

<p>点击「create repository」
</p>
<p>
创建完以后, 等半个小时左右, 属于你的个人主页就配置好了。
</p>
<p>
你可以通过 xxx.github.io 进行访问。其中(xxx为你的github用户名)
</p></div>

</div>

<div id="outline-container-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> 后续完善</h4>
<div class="outline-text-4" id="text-1-2-4">

<p>根据自己的需求配置域名，以及利用web技术进行开发
</p></div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 体验链接</h3>
<div class="outline-text-3" id="text-1-3">

<p>基于github page开发的我的个人主页连接<a href="file:///root/502_XiaoLL_Smile/5001_GitHub/anbgsl1110.github.io/index.html">阿亮的空间</a>。
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2016-07-23T18:52+0800</p>
<p class="author">Author: ALIANG</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
